tap "homebrew/bundle"

# Basics
brew 'git'
brew 'stow' # symlink manager for dotfiles
brew "mas" # Mac App Store CLI

# Shell
brew 'zoxide' # smarter cd
brew 'entr' # run commands when files change
brew 'antidote' # zsh plugin manager

# Git
brew 'git-crypt' # encrypt files in a git repo
brew 'git-delta' # syntax-highlighting pager for git, diff, and grep output
brew 'difftastic' # git diff tool
brew 'lazygit' # terminal UI for git

# Built-in tools replacements
brew 'bat' # better cat
brew 'eza' # better ls
brew 'ripgrep' # better grep
brew 'fd' # better find
brew 'dust' # better du

# Tools
brew 'fzf' # fuzzy finder
brew 'tldr' # simplified man pages
brew 'jq' # json parser
brew 'glow' # markdown reader
brew 'aria2' # download utility
brew 'yt-dlp' # download videos
brew 'ollama' # LLMs

# CLI Apps
brew 'nvim' # neovim
brew 'gh' # GitHub CLI
brew 'btop' # better htop

# Dependencies
brew 'imagemagick' # image processing
brew 'ffmpeg' # video processing
brew 'switchaudio-osx' # switch audio input/output depedency for a shortcut

# Languages
brew 'mise' # version manager

# Fonts
tap 'homebrew/cask-fonts'
cask 'font-iosevka'

# Casks
cask "binary-ninja"
cask "bruno"
cask "chatgpt"
cask "cleanshot"
cask "fork"
cask "google-chrome"
cask "hopper-disassembler"
cask "iina"
cask "istat-menus"
cask "keyboardcleantool"
cask "mac-mouse-fix"
cask "monitorcontrol"
cask "netnewswire"
cask "notion"
cask "obsidian"
cask "qbittorrent"
cask "raycast"
cask "rectangle"
cask "tableplus"
cask "the-unarchiver"
cask "utm"
cask "visual-studio-code"
cask "vivid"
cask "wezterm"
cask "whatsapp"
cask "xcodes"

# Mac App Store
mas "1Blocker", id: 1365531024
mas "Amphetamine", id: 937984704
mas "Day One", id: 1055511498
mas "Developer", id: 640199958
mas "Pixelmator Pro", id: 1289583905
mas "TestFlight", id: 899247664
mas "Userscripts", id: 1463298887
mas "Velja", id: 1607635845

# Work
brew "autossh"
brew "awscli"
brew "xcodegen"
cask "1Password"
cask "android-studio"
cask "figma"
cask "microsoft-teams"
cask "orbstack"
cask "zoom"
