# Basics
brew 'git'
brew 'atuin' # zsh history manager
brew 'stow' # symlink manager for dotfiles
brew "mas" # Mac App Store CLI

# Shell
brew 'zoxide' # smarter cd
brew 'entr' # run commands when files change
brew 'antidote' # zsh plugin manager

# Git
brew 'git-crypt' # encrypt files in a git repo
brew 'git-delta' # syntax-highlighting pager for git, diff, and grep output
brew 'difftastic' # git diff tool
brew 'lazygit' # terminal UI for git

tap 'toby/try', 'git@github.com:tobi/try.git'
brew 'try' # easily create and manage folders for testing things

# Built-in tools replacements
brew 'bat' # better cat
brew 'duf' # better df
brew 'eza' # better ls
brew 'ripgrep' # better grep
brew 'fd' # better find
brew 'dust' # better du

# Tools
brew 'fzf' # fuzzy finder
brew 'tldr' # simplified man pages
brew 'jq' # json parser
brew 'glow' # markdown reader
brew 'aria2' # download utility
brew 'yt-dlp' # download videos

# AI
cask 'codex' # OpenAI Codex
cask 'claude-code' # Anthropic Claude
brew 'gemini-cli' # Google Gemini CLI
brew 'copilot' # GitHub Copilot CLI
brew 'ollama' # LLMs

# AI Tools
tap 'tngranados/newest-files', 'git@github.com:tngranados/newest-files.git'
brew 'newest-files' # find newest files in a git repo

# CLI Apps
brew 'nvim' # neovim
brew 'gh' # GitHub CLI
brew 'btop' # better htop
brew 'lazydocker' # terminal UI for docker
brew 'csvlens' # view CSV files
brew 'bandwhich' # bandwidth utilization tool
brew 'dua-cli' # disk usage analyzer

# Dependencies
brew 'imagemagick' # image processing
brew 'ffmpeg' # video processing
brew 'qpdf' # pdf processing
brew 'switchaudio-osx' # switch audio input/output depedency for a shortcut

# Languages
brew 'mise' # version manager

# Fonts
cask 'font-iosevka'

# Casks
cask "bambu-studio"
cask "bruno"
cask "chatgpt"
cask "cleanshot"
cask "fork"
cask "ghostty"
cask "google-chrome"
cask "iina"
cask "istat-menus"
cask "jordanbaird-ice" # app to manage menu bar apps
cask "logseq"
cask "mac-mouse-fix"
cask "monitorcontrol"
cask "netnewswire"
cask "obsidian"
cask "qbittorrent"
cask "raycast"
cask "tableplus"
cask "the-unarchiver"
cask "visual-studio-code"
cask "vivid-app"
cask "whatsapp"
cask "xcodes"

# Mac App Store
mas "1Blocker", id: 1365531024
mas "Amphetamine", id: 937984704
mas "Day One", id: 1055511498
mas "Developer", id: 640199958
mas "Pixelmator Pro", id: 1289583905
mas "TestFlight", id: 899247664
mas "Userscripts", id: 1463298887
mas "Velja", id: 1607635845

# Work
cask "1Password"
brew "awscli"
cask "microsoft-teams"
mas "NordLayer", id: 1488888843
cask "orbstack"
brew "xcodegen"
cask "zoom"

# Work dependencies
brew "libpq" # for ruby pg gem
brew "libyaml" # ruby
