# Basics
brew 'git'
brew 'stow' # symlink manager for dotfiles

# Shell
brew 'zoxide' # smarter cd
brew 'entr' # run commands when files change
brew 'antidote' # zsh plugin manager

# Git
brew 'git-crypt' # encrypt files in a git repo
brew 'git-delta' # syntax-highlighting pager for git, diff, and grep output
brew 'difftastic' # git diff tool

# Built-in tools replacements
brew 'bat' # better cat
brew 'eza' # better ls
brew 'ripgrep' # better grep
brew 'fd' # better find
brew 'dust' # better du

# Tools
brew 'fzf' # fuzzy finder
brew 'tldr' # simplified man pages
brew 'jq' # json parser
brew 'glow' # markdown reader
brew 'aria2' # download utility
brew 'yt-dlp' # download videos

# CLI Apps
brew 'nvim' # neovim
brew 'gh' # GitHub CLI

# Dependencies
brew 'imagemagick' # image processing
brew 'ffmpeg' # video processing

# Languages
brew 'asdf' # version manager

# Fonts
tap 'homebrew/cask-fonts'
cask 'font-iosevka'
